# Вычислить число c заданной точностью d
# Пример:
# - при $d = 0.001, π = 3.141.$    $10^{-1} ≤ d ≤10^{-10}$

# number = float(input('Введите дробное число: '))
# accuracy = int(input('Задайте точность: '))
# print(round(number, accuracy))

#Задайте натуральное число N. Напишите программу, которая составит список простых множителей числа N.
# number = int(input('Введите число: '))
# empty = []
# index = 2
# while number != 1:
#     if number % index == 0:
#         empty.append(index)
#         number /= index
#     else:
#         index += 1
# print(empty)


# Задайте последовательность чисел.
# Напишите программу, которая выведет список неповторяющихся элементов исходной последовательности.
# some_list = [1, 2, 3, 5, 5, 2, 6, 4, 4]
# print(set(some_list))

# Задана натуральная степень k. Сформировать случайным образом список коэффициентов (значения от 0 до 100)
# многочлена и записать в файл многочлен степени k.
# Пример:
# - k=2 => 2*x² + 4*x + 5 = 0 или x² + 5 = 0 или 10*x² = 0







